Repository: FortiShield/GPT-DB
Catalog: i18n/locales/*/LC_MESSAGES/gptdb_rag.po
Languages: fr, ru

source: Embedding Retriever Operator
fr: Opérateur de Récupération d'Incorporation
ru: Оператор извлечения вложений

source: Retrieve candidates from vector store.
fr: Récupérer les candidats depuis le magasin de vecteurs.
ru: Извлечение кандидатов из векторного хранилища.

source: Vector Store Connector
fr: Connecteur du Magasin de Vecteurs
ru: Коннектор векторного хранилища

source: The vector store connector.
fr: Le connecteur du magasin de vecteurs.
ru: Коннектор векторного хранилища.

source: Top K
fr: Meilleurs K
ru: Топ K

source: The number of candidates.
fr: Le nombre de candidats.
ru: Количество кандидатов.

source: Score Threshold
fr: Seuil de Score
ru: Порог оценки

source: The score threshold, if score of candidate is less than it, it will be filtered.
fr: Le seuil de score, si le score du candidat est inférieur à celui-ci, il sera filtré.
ru: Порог оценки, если оценка кандидата меньше, чем он, он будет отфильтрован.

source: Query Rewrite
fr: Réécriture de Requête
ru: Переписывание запроса

source: The query rewrite resource.
fr: La ressource de réécriture de requête.
ru: Ресурс переписывания запроса.

source: Rerank
fr: Reclassement
ru: Переранжирование

source: The rerank.
fr: Le reclassement.
ru: Переранжирование.

source: Query
fr: Requête
ru: Запрос

source: The query to retrieve.
fr: La requête à récupérer.
ru: Запрос для извлечения.

source: Candidates
fr: Candidats
ru: Кандидаты

source: The retrieved candidates.
fr: Les candidats récupérés.
ru: Извлеченные кандидаты.

source: Embedding Assembler Operator
fr: Opérateur d'Assemblage d'Incorporation
ru: Оператор сборки вложений

source: Load knowledge and assemble embedding chunks to vector store.
fr: Charger les connaissances et assembler les morceaux d'incorporation dans le magasin de vecteurs.
ru: Загрузка знаний и сборка фрагментов вложений в векторное хранилище.

source: Chunk Parameters
fr: Paramètres de Morceau
ru: Параметры фрагмента

source: The chunk parameters.
fr: Les paramètres de morceau.
ru: Параметры фрагмента.

source: Knowledge
fr: Connaissances
ru: Знание

source: The knowledge to be loaded.
fr: Les connaissances à charger.
ru: Знание для загрузки.

source: Chunks
fr: Morceaux
ru: Фрагменты

source: The assembled chunks, it has been persisted to vector store.
fr: Les morceaux assemblés, ils ont été persistés dans le magasin de vecteurs.
ru: Собранные фрагменты, они были сохранены в векторном хранилище.

source: Summary Operator
fr: Opérateur de Résumé
ru: Оператор сводки

source: The summary assembler operator.
fr: L'opérateur d'assemblage de résumé.
ru: Оператор сборки сводки.

source: Knowledge datasource
fr: Source de Connaissances
ru: Источник знаний

source: Document summary
fr: Résumé du document
ru: Сводка документа

source: LLM Client
fr: Client LLM
ru: Клиент LLM

source: The LLM Client.
fr: Le client LLM.
ru: Клиент LLM.

source: Model name
fr: Nom du Modèle
ru: Название модели

source: LLM model name
fr: Nom du modèle LLM
ru: Название модели LLM

source: prompt language
fr: langue de la commande
ru: Язык запроса

source: Max iteration with LLM
fr: Nombre maximal d'itérations avec LLM
ru: Максимальное количество итераций с LLM

source: Concurrency limit with LLM
fr: Limite de concurrence avec LLM
ru: Предел параллелизма с LLM

source: The concurrency limit with llm
fr: La limite de concurrence avec LLM
ru: Предел параллелизма с LLM

source: Query Rewrite Operator
fr: Opérateur de Réécriture de Requête
ru: Оператор переписывания запроса

source: Query rewrite operator.
fr: Opérateur de réécriture de requête.
ru: Оператор переписывания запроса.

source: Query context
fr: Contexte de requête
ru: Контекст запроса

source: query context
fr: contexte de requête
ru: контекст запроса

source: Rewritten queries
fr: Requêtes réécrites
ru: Переписанные запросы

source: LLM model name.
fr: Nom du modèle LLM.
ru: Имя модели LLM.

source: Prompt language
fr: Langue de l'invite
ru: Язык подсказки

source: Prompt language.
fr: Langue de l'invite.
ru: Язык подсказки.

source: Number of results
fr: Nombre de résultats
ru: Количество результатов

source: rewrite query number.
fr: numéro de requête réécrite.
ru: номер переписанного запроса.

source: Knowledge Operator
fr: Opérateur de connaissance
ru: Оператор знаний

source: The knowledge operator, which can create knowledge from datasource.
fr: L'opérateur de connaissance, qui peut créer des connaissances à partir de la source de données.
ru: Оператор знаний, который может создавать знания из источника данных.

source: knowledge datasource
fr: source de données de connaissance
ru: источник знаний

source: knowledge datasource, which can be a document, url, or text.
fr: source de données de connaissance, qui peut être un document, une URL ou un texte.
ru: источник знаний, который может быть документом, URL-адресом или текстом.

source: Knowledge object.
fr: Objet de connaissance.
ru: Объект знаний.

source: Default datasource
fr: Source de données par défaut
ru: Источник данных по умолчанию

source: Default datasource.
fr: Source de données par défaut.
ru: Источник данных по умолчанию.

source: Knowledge type
fr: Type de connaissance
ru: Тип знаний

source: Knowledge type.
fr: Type de connaissance.
ru: Тип знаний.

source: Chunks To String Operator
fr: Opérateur de conversion de morceaux en chaîne
ru: Оператор преобразования чанков в строку

source: Convert chunks to string.
fr: Convertir des morceaux en chaîne.
ru: Преобразовать чанки в строку.

source: Separator
fr: Séparateur
ru: Разделитель

source: The separator between chunks.
fr: Le séparateur entre les morceaux.
ru: Разделитель между чанками.

source: The input chunks.
fr: Les morceaux d'entrée.
ru: Входные чанки.

source: String
fr: Chaîne de caractères
ru: Строка

source: The output string.
fr: La chaîne de caractères en sortie.
ru: Выходная строка.

source: Default Embeddings
fr: Incorporations par défaut
ru: Эмбеддинги по умолчанию

source: Default embeddings(using default embedding model of current system)
fr: Incorporations par défaut (utilisant le modèle d'incorporation par défaut du système actuel)
ru: Эмбеддинги по умолчанию (используя модель эмбеддинга по умолчанию текущей системы)

source: HuggingFace Embeddings
fr: Incorporations HuggingFace
ru: Эмбеддинги HuggingFace

source: HuggingFace sentence_transformers embedding models.
fr: Modèles d'incorporation de phrases HuggingFace sentence_transformers.
ru: Модели эмбеддингов HuggingFace sentence_transformers.

source: Model Name
fr: Nom du modèle
ru: Имя модели

source: Model name to use.
fr: Nom du modèle à utiliser.
ru: Имя модели для использования.

source: HuggingFace Instructor Embeddings
fr: Incorporations HuggingFace Instructor
ru: Эмбеддинги HuggingFace Instructor

source: HuggingFace Instructor embeddings.
fr: Incorporations HuggingFace Instructor.
ru: Эмбеддинги HuggingFace Instructor.

source: Embed Instruction
fr: Instruction d'incorporation
ru: Инструкция для эмбеддинга

source: Instruction to use for embedding documents.
fr: Instruction à utiliser pour l'incorporation des documents.
ru: Инструкция для использования при эмбеддинге документов.

source: Query Instruction
fr: Instruction de requête
ru: Инструкция для запроса

source: Instruction to use for embedding query.
fr: Instruction à utiliser pour l'incorporation de la requête.
ru: Инструкция для использования при эмбеддинге запроса.

source: HuggingFace Inference API Embeddings
fr: Embarcations de l'API d'inférence HuggingFace
ru: Векторные представления HuggingFace Inference API

source: HuggingFace Inference API embeddings.
fr: Embarcations de l'API d'inférence HuggingFace.
ru: Векторные представления HuggingFace Inference API.

source: API Key
fr: Clé API
ru: Ключ API

source: Your API key for the HuggingFace Inference API.
fr: Votre clé API pour l'API d'inférence HuggingFace.
ru: Ваш ключ API для HuggingFace Inference API.

source: The name of the model to use for text embeddings.
fr: Le nom du modèle à utiliser pour les embarcations de texte.
ru: Название модели для использования в текстовых векторных представлениях.

source: Jina AI Embeddings
fr: Embarcations Jina AI
ru: Векторные представления Jina AI

source: Jina AI embeddings.
fr: Embarcations Jina AI.
ru: Векторные представления Jina AI.

source: Your API key for the Jina AI API.
fr: Votre clé API pour l'API Jina AI.
ru: Ваш ключ API для Jina AI API.

source: OpenAPI Embeddings
fr: Embarcations OpenAPI
ru: Векторные представления OpenAPI

source: OpenAPI embeddings.
fr: Embarcations OpenAPI.
ru: Векторные представления OpenAPI.

source: API URL
fr: URL de l'API
ru: URL API

source: The URL of the embeddings API.
fr: L'URL de l'API des embarcations.
ru: URL для векторных представлений API.

source: Your API key for the Open API.
fr: Votre clé API pour l'API Open.
ru: Ваш ключ API для Open API.

source: Timeout
fr: Temps d'attente
ru: Время ожидания

source: The timeout for the request in seconds.
fr: Le temps d'attente de la requête en secondes.
ru: Время ожидания запроса в секундах.

source: Chunk Strategy
fr: Stratégie de morcellement
ru: Стратегия фрагментации

source: chunk strategy
fr: stratégie de morcellement
ru: стратегия фрагментации

source: Text Splitter
fr: Séparateur de texte
ru: Разделитель текста

source: Text splitter, if not set, will use the default text splitter.
fr: Séparateur de texte, s'il n'est pas défini, utilisera le séparateur de texte par défaut.
ru: Разделитель текста, если не установлен, будет использовать стандартный разделитель текста.

source: Splitter Type
fr: Type de séparateur
ru: Тип разделителя

source: Splitter type
fr: Type de séparateur
ru: Тип разделителя

source: Chunk Size
fr: Taille du morceau
ru: Размер фрагмента

source: Chunk size
fr: Taille du morceau
ru: Размер фрагмента

source: Chunk Overlap
fr: Chevauchement de morceaux
ru: Перекрытие фрагментов

source: Chunk separator
fr: Séparateur de morceaux
ru: Разделитель фрагментов

source: Enable Merge
fr: Activer la fusion
ru: Включить объединение

source: Enable chunk merge by chunk_size.
fr: Activer la fusion de morceaux par taille de morceau.
ru: Включить объединение фрагментов по размеру фрагмента.

source: Default Ranker
fr: Classement par défaut
ru: Стандартный ранжировщик

source: Default ranker(Rank by score).
fr: Classement par défaut (Classement par score).
ru: Стандартный ранжировщик (ранжировать по оценке).

source: Top k
ru: Лучшие k

source: The number of top k documents.
fr: Le nombre de documents top k.
ru: Количество лучших k документов.

source: Query rewrite.
fr: Réécriture de requête.
ru: Переписывание запроса.

source: The LLM model name.
fr: Le nom du modèle LLM.
ru: Название модели LLM.

source: The llm client.
fr: Le client LLM.
ru: Клиент LLM.

source: Language
fr: Langue
ru: Язык

source: The language of the query rewrite prompt.
fr: La langue de l'invite de réécriture de requête.
ru: Язык запроса на переписывание.

source: Character Text Splitter
fr: Séparateur de texte par caractère
ru: Разделитель текста по символам

source: Separator to split the text.
fr: Séparateur pour diviser le texte.
ru: Разделитель для разделения текста.

source: Recursive Character Text Splitter
fr: Diviseur de texte caractère récursif
ru: Рекурсивный разделитель текста по символам.

source: Split text by characters recursively.
fr: Diviser le texte par caractères de manière récursive.
ru: Разделить текст рекурсивно по символам.

source: Spacy Text Splitter
fr: Diviseur de texte Spacy
ru: Spacy разделитель текста.

source: Spacy pipeline to use for tokenization.
fr: Pipeline Spacy à utiliser pour la tokenisation.
ru: Spacy конвейер для токенизации.

source: Split text by sentences using Spacy.
fr: Diviser le texte en phrases en utilisant Spacy.
ru: Разделить текст на предложения с использованием Spacy.

source: Markdown Header Text Splitter
fr: Diviseur de texte d'en-tête Markdown
ru: Разделитель текста заголовков Markdown.

source: Return each line with associated headers.
fr: Renvoyer chaque ligne avec les en-têtes associés.
ru: Вернуть каждую строку с соответствующими заголовками.

source: Size of each chunk.
fr: Taille de chaque morceau.
ru: Размер каждого фрагмента.

source: Split markdown text by headers.
fr: Diviser le texte Markdown par en-têtes.
ru: Разделить текст Markdown по заголовкам.

source: Separator Text Splitter
fr: Diviseur de texte par séparateur
ru: Разделитель текста.

source: Split text by separator.
fr: Diviser le texte par séparateur.
ru: Разделить текст по разделителю.

source: Page Text Splitter
fr: Diviseur de texte par page
ru: Разделитель текста страницы.

source: Split text by page.
fr: Diviser le texte par page.
ru: Разделить текст по странице.
